Tekla Open API Reference for Tekla Structures 2025
HyperLink Constructor
Overload List
Name | Description
HyperLink(ViewBase, Point, Uri, String)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
HyperLink(ViewBase, Point, Uri, String, Size)
 Creates a new hyperlink instance using standard attributes.
HyperLink(ViewBase, Point, Uri, String, Size, LinkAttributes)
 Creates a new hyperlink instance using the given attributes.
Top
See Also
Reference
HyperLink Class
Tekla.Structures.Drawing Namespace